app/controllers/health_records_controller.rb

SELECT "health_records".* FROM "health_records"
---
  def index
    @health_records = HealthRecord.all

INSERT INTO "health_records" ("name", "birthday", "diagnosis", "recorded_by", "history", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @health_record = HealthRecord.new(health_record_params)

    respond_to do |format|
      if @health_record.save

UPDATE "health_records" SET "diagnosis" = ?, "history" = ?, "updated_at" = ? WHERE "health_records"."id" = ?
---
  def update
    respond_to do |format|
      if @health_record.update(health_record_params)

DELETE FROM "health_records" WHERE "health_records"."id" = ?  [["id", 5]]
---
  def destroy
    @health_record.destroy

SELECT  "health_records".* FROM "health_records" WHERE "health_records"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_health_record
      @health_record = HealthRecord.find(params[:id])