app/controllers/households_controller.rb

SELECT "households".* FROM "households"
---
  def index
    @households = Household.all

INSERT INTO "households" ("name", "address", "phone", "log", "date_of_residency", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @household = Household.new(household_params)

    respond_to do |format|
      if @household.save

SELECT  "households".* FROM "households" WHERE "households"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_household
      @household = Household.find(params[:id])