app/controllers/incidents_controller.rb

SELECT "incidents".* FROM "incidents"
---
  def index
    @incidents = Incident.all

INSERT INTO "incidents" ("address", "reported_by", "phone", "date", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @incident = Incident.new(incident_params)

    respond_to do |format|
      if @incident.save

SELECT  "incidents".* FROM "incidents" WHERE "incidents"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_incident
      @incident = Incident.find(params[:id])