app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "carlotaapomoy"], ["LIMIT", 1]]
---
	def new_login
		@username = params[:username]
		@password = params[:password]

		@u = User.find_by(username: @username)