app/controllers/records_controller.rb

SELECT "records".* FROM "records"
---
  def index
    @records = Record.all

INSERT INTO "records" ("name", "phone", "email", "order", "deadline", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @record = Record.new(record_params)

    respond_to do |format|
      if @record.save

UPDATE "records" SET "order" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["order", "awjdjkawdkjawkdjkawdawdaw HAHAHA"], ["updated_at", "2019-10-15 13:18:15.540311"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @record.update(record_params)

DELETE FROM "records" WHERE "records"."id" = ?  [["id", 1]]
---
  def destroy
    @record.destroy

SELECT  "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_record
      @record = Record.find(params[:id])