app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "mat"], ["password_digest", "$2a$12$8NhWrCBK1fUtIXikGUSTEux1PB9SXF/VeC2pM98oGQ9iJ7mX0Kd4m"], ["created_at", "2019-10-02 12:40:06.612876"], ["updated_at", "2019-10-02 12:40:06.612876"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save